tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "oven-sh/bun"
# Search tool like grep, but optimized for programmers
brew "ack"
# Next-generation aircrack with lots of new features
brew "aircrack-ng"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# More intuitive version of du in rust
brew "dust"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Open-source video transcoder available for Linux, Mac, and Windows
brew "handbrake"
# World's fastest and most advanced password recovery utility
brew "hashcat"
# Utils for conversion of cap/pcap/pcapng WiFi dump files
brew "hcxtools"
# Apache HTTP server
brew "httpd"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Pager program similar to more
brew "less"
# Mac App Store command-line interface
brew "mas"
# Matroska media files manipulation tools
brew "mkvtoolnix"
# Read, create, and modify MP4 files
brew "mp4v2"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Open source relational database management system
brew "mysql"
# Node version management
brew "n"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Platform built on V8 to build network applications
brew "node"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# General-purpose scripting language
brew "php"
# Fast, disk space efficient package manager
brew "pnpm"
# Object-relational database system
brew "postgresql@14"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Simplified and community-driven man pages
brew "tldr"
# Command-line interface to the freedesktop.org trashcan
brew "trash-cli", link: true
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Application launcher and productivity software
cask "alfred"
# Menu bar icon organiser
cask "bartender"
# Tool to customise input devices and automate computer systems
cask "bettertouchtool"
# Utility to create and modify archives
cask "betterzip"
# Tool to remove unnecessary files and folders from disk
cask "cleanmymac"
# Universal database tool and SQL client
cask "dbeaver-community"
# Downloads videos from different websites
cask "downie"
# Web browser
cask "firefox"
cask "font-fira-code-nerd-font"
cask "font-inconsolata"
cask "font-petit-formal-script"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Open-source video transcoder
cask "handbrake"
# Tool to optimise images to a smaller size
cask "imageoptim"
# System monitoring app
cask "istat-menus"
# Native desktop app for Messenger (formerly Facebook Messenger)
cask "messenger"
# Home media player
cask "plex"
# Home media server
cask "plex-media-server"
# Quick Look plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Quick Look plugin for plaintext files without an extension
cask "qlstephen"
# Thumbnails, static previews, cover art and metadata for video files
cask "qlvideo"
# Quick Look plugin for CSV files
cask "quicklook-csv"
# Quick Look plugin for JSON files
cask "quicklook-json"
# Music streaming service
cask "spotify"
# Application for inspecting installer packages
cask "suspicious-package"
# Open-source BitTorrent client
cask "transmission"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Multiplayer code editor
cask "zed"
# Gecko based web browser
cask "zen-browser"
mas "Amphetamine", id: 937984704
mas "DaisyDisk", id: 411643860
mas "Fantastical", id: 975937182
mas "Gemini 2", id: 1090488118
mas "Just Focus", id: 1142151959
mas "Mactracker", id: 430255202
mas "MindNode", id: 1289197285
mas "Name Mangler", id: 603637384
mas "Numbers", id: 409203825
mas "OmniFocus", id: 1346203938
mas "Pages", id: 409201541
mas "PrettyJSON for Safari", id: 1445328303
mas "WhatsApp", id: 310633997
vscode "1000ch.svgo"
vscode "aaron-bond.better-comments"
vscode "astro-build.astro-vscode"
vscode "biomejs.biome"
vscode "bradgashler.htmltagwrap"
vscode "bradlc.vscode-tailwindcss"
vscode "chakrounanas.turbo-console-log"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "clinyong.vscode-css-modules"
vscode "ctcuff.font-preview"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "donjayamanne.githistory"
vscode "dotiful.dotfiles-syntax-highlighting"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "humao.rest-client"
vscode "huuums.vscode-fast-folder-structure"
vscode "ibm.output-colorizer"
vscode "irongeek.vscode-env"
vscode "jock.svg"
vscode "johnpapa.vscode-peacock"
vscode "keesschollaart.vscode-home-assistant"
vscode "lllllllqw.jsdoc"
vscode "markis.code-coverage"
vscode "mattpocock.ts-error-translator"
vscode "mechatroner.rainbow-csv"
vscode "mgmcdermott.vscode-language-babel"
vscode "mhutchie.git-graph"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.live-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "orta.vscode-jest"
vscode "oven.bun-vscode"
vscode "p42ai.refactor"
vscode "phoenisx.cssvar"
vscode "pkief.material-icon-theme"
vscode "pnp.polacode"
vscode "prisma.prisma"
vscode "pucelle.vscode-css-navigation"
vscode "qwtel.sqlite-viewer"
vscode "stkb.rewrap"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-french"
vscode "stylelint.vscode-stylelint"
vscode "tal7aouy.icons"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "unifiedjs.vscode-mdx"
vscode "viijay-kr.react-ts-css"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitest.explorer"
vscode "vivaxy.vscode-conventional-commits"
vscode "wallabyjs.console-ninja"
vscode "wallabyjs.quokka-vscode"
vscode "wallabyjs.wallaby-vscode"
vscode "wix.vscode-import-cost"
vscode "xabikos.javascriptsnippets"
vscode "xyc.vscode-mdx-preview"
vscode "yoavbls.pretty-ts-errors"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
