tap "anomalyco/tap"
tap "can1357/tap"
tap "libsql/sqld"
tap "oven-sh/bun"
tap "xykong/tap"
# Search tool like grep, but optimized for programmers
brew "ack"
# Next-generation aircrack with lots of new features
brew "aircrack-ng"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Read-only developer endpoint scanner for supply-chain exposure
brew "bumblebee"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# More intuitive version of du in rust
brew "dust"
# Run arbitrary commands when files change
brew "entr"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# World's fastest and most advanced password recovery utility
brew "hashcat"
# Utils for conversion of cap/pcap/pcapng WiFi dump files
brew "hcxtools"
# Apache HTTP server
brew "httpd"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Command-line benchmarking tool
brew "hyperfine"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Pager program similar to more
brew "less"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Fast, flexible, config-based cli for linting Markdown/CommonMark files
brew "markdownlint-cli2"
# Mac App Store command-line interface
brew "mas"
# Matroska media files manipulation tools
brew "mkvtoolnix"
# Read, create, and modify MP4 files
brew "mp4v2"
# Node version management
brew "n"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: :changed
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# General-purpose scripting language
brew "php"
# Fast, disk space efficient package manager
brew "pnpm"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Cross-shell prompt for astronauts
brew "starship"
# Official tldr client written in Rust
brew "tlrc"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Command-line interface to the freedesktop.org trashcan
brew "trash-cli", link: true
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Language for application scale JavaScript development
brew "typescript"
# Watch files and take action when they change
brew "watchman"
# Command-line interface for Vercel
brew "vercel-cli"
# Internet file retriever
brew "wget"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Coding agent with the IDE wired in
brew "can1357/tap/omp", trusted: true
# Utility to add Dynamic Island like features to notch area
cask "alcove"
# Application launcher and productivity software
cask "alfred"
# Distribution of the Python and R programming languages for scientific computing
cask "anaconda"
# Menu bar icon organiser
cask "bartender"
# Tool to customise input devices and automate computer systems
cask "bettertouchtool"
# Utility to create and modify archives
cask "betterzip"
# Web browser focusing on privacy
cask "brave-browser"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Tool to remove unnecessary files and folders from disk
cask "cleanmymac"
# Universal database tool and SQL client
cask "dbeaver-community"
# Voice and text chat software
cask "discord"
# Window peeking utility app
cask "dockdoor"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Downloads videos from different websites
cask "downie"
# Web browser
cask "firefox"
# Markdown previews in Finder QuickLook with diagrams and math
cask "xykong/tap/flux-markdown"
cask "font-atkinson-hyperlegible"
cask "font-atkinson-hyperlegible-mono"
cask "font-atkinson-hyperlegible-next"
cask "font-fira-code-nerd-font"
cask "font-inconsolata"
cask "font-meslo-lg-nerd-font"
cask "font-monaspace"
cask "font-nova-mono"
cask "font-petit-formal-script"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Open-source video transcoder
cask "handbrake-app"
# Free and open-source media player
cask "iina"
# Tool to optimise images to a smaller size
cask "imageoptim"
# System monitoring app
cask "istat-menus"
# Spot and merge differences in text and image files or folders
cask "kaleidoscope@3"
# Customise mouse behavior
cask "linearmouse"
# Discover, download, and run local LLMs
cask "lm-studio"
# Desktop application for Open WebUI
cask "open-webui"
# Home media player
cask "plex"
# Home media server
cask "plex-media-server"
# IDE for professional Python development
cask "pycharm"
# Quick Look plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# Quick Look plugin for plaintext files without an extension
cask "qlstephen"
# Quick Look plugin for CSV files
cask "quicklook-csv"
# Quick Look plugin for JSON files
cask "quicklook-json"
# Thumbnails, static previews, cover art and metadata for video files
cask "quicklook-video"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Application for inspecting installer packages
cask "suspicious-package"
# Minimal GUI for AI code agents
cask "t3-code"
# Open-source BitTorrent client
cask "transmission"
# Open-source code editor
cask "visual-studio-code"
# Native desktop client for WhatsApp
cask "whatsapp"
# Multiplayer code editor
cask "zed"
mas "Actions", id: 1586435171
mas "Amazing AI", id: 1660147028
mas "Amphetamine", id: 937984704
mas "DaisyDisk", id: 411643860
mas "Fantastical", id: 975937182
mas "Gemini 2", id: 1090488118
mas "Gifski", id: 1351639930
mas "JustFocus", id: 1142151959
mas "Mactracker", id: 430255202
mas "MindNode Classic", id: 1289197285
mas "Name Mangler 3", id: 603637384
mas "Numbers", id: 409203825
mas "OmniFocus", id: 1346203938
mas "One Thing", id: 1604176982
mas "Pages", id: 409201541
mas "Pandan", id: 1569600264
mas "PrettyJSON for Safari", id: 1445328303
mas "Reeder", id: 880001334
mas "RetroArch", id: 6499539433
mas "Shareful", id: 1522267256
mas "Xcode", id: 497799835
vscode "1000ch.svgo"
vscode "aaron-bond.better-comments"
vscode "andrejunges.handlebars"
vscode "astro-build.astro-vscode"
vscode "bierner.markdown-mermaid"
vscode "bradgashler.htmltagwrap"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "chakrounanas.turbo-console-log"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "clinyong.vscode-css-modules"
vscode "codacy-app.codacy"
vscode "coderabbit.coderabbit-vscode"
vscode "cosminalco.pomodoro"
vscode "ctcuff.font-preview"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "donjayamanne.githistory"
vscode "dotiful.dotfiles-syntax-highlighting"
vscode "embertooling.vscode-ember"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "github.codespaces"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "hideoo.starlight-links"
vscode "ibm.output-colorizer"
vscode "irongeek.vscode-env"
vscode "jock.svg"
vscode "johnpapa.vscode-peacock"
vscode "keesschollaart.vscode-home-assistant"
vscode "lllllllqw.jsdoc"
vscode "markis.code-coverage"
vscode "mechatroner.rainbow-csv"
vscode "mgmcdermott.vscode-language-babel"
vscode "ms-playwright.playwright"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "oven.bun-vscode"
vscode "oxc.oxc-vscode"
vscode "p42ai.refactor"
vscode "phoenisx.cssvar"
vscode "pnp.polacode"
vscode "pucelle.vscode-css-navigation"
vscode "qwtel.sqlite-viewer"
vscode "redhat.vscode-xml"
vscode "stkb.rewrap"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-french"
vscode "stylelint.vscode-stylelint"
vscode "tamasfe.even-better-toml"
vscode "techopolis.omlx-copilot-chat"
vscode "tomoki1207.pdf"
vscode "typescriptteam.native-preview"
vscode "typescriptteam.native-preview"
vscode "unifiedjs.vscode-mdx"
vscode "vitest.explorer"
vscode "voidzero.vite-plus-extension-pack"
vscode "wix.vscode-import-cost"
vscode "xyc.vscode-mdx-preview"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
npm "corepack"
